# Ordinal number Encoding(Encoding Based on Rank)

In [1]:
import datetime

In [2]:
today_date=datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2021, 6, 24, 12, 30, 28, 808239)

In [4]:
today_date-datetime.timedelta(3)

datetime.datetime(2021, 6, 21, 12, 30, 28, 808239)

In [6]:
#List Comprehension

days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [7]:
days

[datetime.datetime(2021, 6, 24, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 23, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 22, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 21, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 20, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 19, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 18, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 17, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 16, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 15, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 14, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 13, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 12, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 11, 12, 30, 28, 808239),
 datetime.datetime(2021, 6, 10, 12, 30, 28, 808239)]

In [63]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=["Day"]

In [11]:
data.head()

                         Day
0 2021-06-24 12:30:28.808239
1 2021-06-23 12:30:28.808239
2 2021-06-22 12:30:28.808239
3 2021-06-21 12:30:28.808239
4 2021-06-20 12:30:28.808239

In [19]:
data['weekday']=data["Day"].dt.day_name()

In [20]:
data

                          Day    weekday
0  2021-06-24 12:30:28.808239   Thursday
1  2021-06-23 12:30:28.808239  Wednesday
2  2021-06-22 12:30:28.808239    Tuesday
3  2021-06-21 12:30:28.808239     Monday
4  2021-06-20 12:30:28.808239     Sunday
5  2021-06-19 12:30:28.808239   Saturday
6  2021-06-18 12:30:28.808239     Friday
7  2021-06-17 12:30:28.808239   Thursday
8  2021-06-16 12:30:28.808239  Wednesday
9  2021-06-15 12:30:28.808239    Tuesday
10 2021-06-14 12:30:28.808239     Monday
11 2021-06-13 12:30:28.808239     Sunday
12 2021-06-12 12:30:28.808239   Saturday
13 2021-06-11 12:30:28.808239     Friday
14 2021-06-10 12:30:28.808239   Thursday

In [16]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [17]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [21]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [22]:
data

                          Day    weekday  weekday_ordinal
0  2021-06-24 12:30:28.808239   Thursday                4
1  2021-06-23 12:30:28.808239  Wednesday                3
2  2021-06-22 12:30:28.808239    Tuesday                2
3  2021-06-21 12:30:28.808239     Monday                1
4  2021-06-20 12:30:28.808239     Sunday                7
5  2021-06-19 12:30:28.808239   Saturday                6
6  2021-06-18 12:30:28.808239     Friday                5
7  2021-06-17 12:30:28.808239   Thursday                4
8  2021-06-16 12:30:28.808239  Wednesday                3
9  2021-06-15 12:30:28.808239    Tuesday                2
10 2021-06-14 12:30:28.808239     Monday                1
11 2021-06-13 12:30:28.808239     Sunday                7
12 2021-06-12 12:30:28.808239   Saturday                6
13 2021-06-11 12:30:28.808239     Friday                5
14 2021-06-10 12:30:28.808239   Thursday                4

# Count or frequency Encoding

In [51]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)

In [52]:
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [53]:
columns=[1,3,5,6,7,8,9,13]
train_set=train_set[columns]

In [54]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [55]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [56]:
#Finding Labels of each column
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [57]:
len(train_set['Designation'].unique())

15

In [60]:
country_map=train_set['Country'].value_counts().to_dict()

In [61]:
country_map

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' Greece': 29,
 ' France': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Thailand': 18,
 ' Laos': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Hungary': 13,
 ' Honduras': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [62]:
train_set['Country']=train_set['Country'].map(country_map)
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

In [ ]:
#ADVANTAGE 
1.Easy to use
2.Not Increasing feature space

#Disadvantage
1.It will provide same weight if frequencies are same


# Target Guided Ordinal Encoding


1.Ordering the labels according to target
2.Replace the labels by the joint probably of being 1 or 0

In [64]:
df=pd.read_csv('D:/Dataset/titanic/train.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [65]:
df['Cabin'].fillna('Missing',inplace=True)

In [66]:
df['Cabin']

0      Missing
1          C85
2      Missing
3         C123
4      Missing
        ...
886    Missing
887        B42
888    Missing
889       C148
890    Missing
Name: Cabin, Length: 891, dtype: object

In [67]:
df['Cabin']=df['Cabin'].astype(str).str[0] #retrieving 1st letter from the cabin so that we could know the block
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [68]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [69]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [71]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [72]:
enumerate(ordinal_labels,0)

In [73]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [74]:
df['Cabin_Ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_Ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

In [75]:
#MEAN ENCODING
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [76]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [77]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_Ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

# ONE HOT ENCODING

In [78]:
import pandas as pd

In [80]:
df=pd.read_csv('D:/Dataset/titanic/train.csv',usecols=['Sex'])

In [81]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [82]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [83]:
df=pd.read_csv('D:/Dataset/titanic/train.csv',usecols=['Embarked'])

In [84]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [85]:
df.dropna(inplace=True)

In [86]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [ ]:
#One hot encoding with multiple categories

In [88]:
df=pd.read_csv('D:/Dataset/mercedez/train.csv',usecols=["X0","X1","X2","X3","X4","X5","X6"])
df

      X0 X1  X2 X3 X4  X5 X6
0      k  v  at  a  d   u  j
1      k  t  av  e  d   y  l
2     az  w   n  c  d   x  j
3     az  t   n  f  d   x  l
4     az  v   n  f  d   h  d
...   .. ..  .. .. ..  .. ..
4204  ak  s  as  c  d  aa  d
4205   j  o   t  d  d  aa  h
4206  ak  v   r  a  d  aa  g
4207  al  r   e  f  d  aa  l
4208   z  r  ae  c  d  aa  g

[4209 rows x 7 columns]

In [89]:
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [90]:
for i in df.columns:
    print(len(df[i].unique())) #unique value of each features

47
27
44
7
4
29
12

In [91]:
df.X1.value_counts().sort_values(ascending=False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [93]:
first_10=df.X1.value_counts().sort_values(ascending=False).head(10).index

In [94]:
first_10=list(first_10)

In [95]:
import numpy as np
for categories in first_10:
    df[categories]=np.where(df['X1']==categories,1,0)

In [96]:
first_10.append('X1')

In [97]:
df[first_10]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]

# Probability Ratio Encoding

In [ ]:
1.Probability of survived based on cabin(categorical)
2.probability of not survived=1-pr(Survived)
3.pr(survived)/pr(Not survived)
4.Dictionary to map cabin with probability
5.Replace with the categorical feature

In [98]:
df=pd.read_csv('D:/Dataset/titanic/train.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [100]:
df['Cabin'].fillna('Missing',inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [101]:
df['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [102]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [104]:
prob_df=df.groupby(['Cabin'])['Survived'].mean()

In [106]:
prob_df=pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [107]:
prob_df['Died']=1-prob_df['Survived']

In [108]:
prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [109]:
prob_df['Probability_ratio']=prob_df['Survived']/prob_df['Died']
prob_df.head()

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [110]:
probability_encoded=prob_df['Probability_ratio'].to_dict()

In [111]:
probability_encoded

{'A': 0.875,
 'B': 2.916666666666666,
 'C': 1.4583333333333333,
 'D': 3.125,
 'E': 3.0,
 'F': 1.6000000000000003,
 'G': 1.0,
 'M': 0.42827442827442824,
 'T': 0.0}

In [112]:
df['Cabin_encoded']=df['Cabin'].map(probability_encoded)
df.head()

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274